In [5]:
import numpy as np
from numpy.random import randn
import pandas as pd
from pandas import Series, DataFrame

In [10]:
ser1 = Series(randn(6), index = [[1, 1, 1, 2, 2, 2], ["a", "b", "c", "a", "b", "c"]])
ser1

1  a   -1.932063
   b   -0.913456
   c   -1.660618
2  a   -0.152214
   b   -0.159444
   c    0.502163
dtype: float64

In [12]:
ser1.index

MultiIndex([(1, 'a'),
            (1, 'b'),
            (1, 'c'),
            (2, 'a'),
            (2, 'b'),
            (2, 'c')],
           )

In [14]:
ser1[1]

a   -1.932063
b   -0.913456
c   -1.660618
dtype: float64

In [18]:
ser1[2]

a   -0.152214
b   -0.159444
c    0.502163
dtype: float64

In [22]:
ser1[:, "a"]

1   -1.932063
2   -0.152214
dtype: float64

In [26]:
dframe1 = ser1.unstack()
dframe1

          a         b         c
1 -1.932063 -0.913456 -1.660618
2 -0.152214 -0.159444  0.502163

In [9]:
dframe2 = DataFrame(np.arange(16).reshape(4, 4), index = [["a", "a", "b", "b"], [1, 2, 1, 2]],
                    columns = [["NY", "NY", "LA", "SF"], ["cold", "hot", "hot", "cold"]])
dframe2

      NY      LA   SF
    cold hot hot cold
a 1    0   1   2    3
  2    4   5   6    7
b 1    8   9  10   11
  2   12  13  14   15

In [13]:
dframe2.index.names = ["INDEX_1", "INDEX_2"]
dframe2.columns.names = ["Cities", "Temps"]
dframe2

Cities            NY      LA   SF
Temps           cold hot hot cold
INDEX_1 INDEX_2
a       1          0   1   2    3
        2          4   5   6    7
b       1          8   9  10   11
        2         12  13  14   15

In [17]:
dframe2.swaplevel("Cities", "Temps", axis = 1)

Temps           cold hot     cold
Cities            NY  NY  LA   SF
INDEX_1 INDEX_2
a       1          0   1   2    3
        2          4   5   6    7
b       1          8   9  10   11
        2         12  13  14   15

In [27]:
dframe2.sort_index(level = 1)

Cities            NY      LA   SF
Temps           cold hot hot cold
INDEX_1 INDEX_2
a       1          0   1   2    3
b       1          8   9  10   11
a       2          4   5   6    7
b       2         12  13  14   15

In [ ]:
dframe2.groupby(level = 'Temps', axis = 1).sum()